app/controllers/phrases_controller.rb

  def create
    @phrase = Phrase.create(phrase_params)
---
INSERT INTO "phrases" ("content", "created_on") VALUES ($1, $2) RETURNING "id"  [["content", "Hello Everyone"], ["created_on", "2017-08-21 13:28:17.960263"]]

  def show
    @phrase = Phrase.find(params[:id])
---
SELECT  "phrases".* FROM "phrases" WHERE "phrases"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]